MHD/Blishchik_cases/shercliff_mhdEpotFoam_Ha20/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

d 1;            // aspect ratio

md #calc "0 - $d";

vertices
(
    (0 -1 $md)  // 0
    (20 -1 $md) // 1
    (20 1 $md)  // 2
    (0 1 $md)   // 3
    (0 -1 $d)   // 4
    (20 -1 $d)  // 5
    (20 1 $d)   // 6
    (0 1 $d)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 40 20)
    simpleGrading
    (1                      // x grading
    (                       // y grading
        (0.5 0.5 10)        // 50% of geometry, 50% of cells, expansion ratio 10
        (0.5 0.5 0.1)       // 50% of geometry, 50% of cells, expansion ratio 0.1
    )
    (                       // z grading
        (0.5 0.5 10)        // 50% of geometry, 50% of cells, expansion ratio 10
        (0.5 0.5 0.1)       // 50% of geometry, 50% of cells, expansion ratio 0.1
    ))
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    topWall
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    botWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    frontWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    backWall
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
