MHD/Blishchik_cases/shercliff_mhdEpotFoam_Ha20/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  4;

method          simple;

regions
{
    solid
    {
        numberOfSubdomains  4;
        method      simple;

        coeffs
        {
            n       (2 2 1);
        }
    }
}

coeffs
{
    n       (2 2 1);
}


// ************************************************************************* //
